OpenFOAM-v2112-AD/tutorials/heatTransfer/chtMultiRegionFoam/reverseBurner/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication splitMeshRegions -cellZonesOnly -overwrite

runApplication topoSet -region gas

paraFoam -region gas -touch
paraFoam -region solid -touch

runApplication decomposePar -allRegions

runParallel $(getApplication)

runApplication reconstructPar -allRegions -newTimes

#------------------------------------------------------------------------------
